package fullstack2.langex;
/*
 * Java Annotation : 어노테이션은 자바에서는 필수로 알아야 하는 개념입니다.
 * 얘가 하는 일은 음...컴파일 시 컴파일러에게 특정 코드의 정보를 전달하는
 * 개념과(ex> 오버라이드 했다 등)
 * 이클립스와 같은 Code 빌더(Builder)에게 지정된 어노테이션을 컴파일 or 실행 시 등에
 * 실행을 하라는 의미, 그리고, 실행 시에는 특정 기능을 수행하라는 의미를 담고 있습니다.
 * 이 말은 어노테이션 자체가 어떤 기능을 내포하고 있다라고 생각하시면 됩니다.
 * 
 * 자바에서는 어노테이션을 클래스와는 다른 개념으로 적용하고 있는데,
 * 생성은 인터페이스를 이용하고 있습니다.
 * 선연형식은 인터페이스 키워드 앞에 @ 을 붙여주면 자동으로 어노테이션으로 컴파일 하게 됩니다.
 * 
 * 따라서 어노테이션은 자동으로 인터페이스가 갖는 기능적인 부분(메서드), 필드를 사용할 수 있고
 * 이를 필요에 따라서 프로그래머가 정의하는 클래스 등에 @AnnotationName을 선언해서
 * 컴파일, 실행 시에 해당 어노테이션이 기능을 수행할 수 있도록 합니다.
 * 
*/
public class AnnotationExam {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
